public class lesson_06_13{
    public static void main(String[] args) {
        //Инициализация массива, кол-во дней в месяце
        int[] months1 = new int[12];
        months1[0] = 31; // январь
        months1[1] = 28; // февраль
        months1[2] = 31; // март
        months1[3] = 30; // апрель
        months1[4] = 31; // май
        months1[5] = 30; // июнь
        months1[6] = 31; // июль
        months1[7] = 31; // август
        months1[8] = 30; // сентябрь
        months1[9] = 31; // октябрь
        months1[10] = 30; // ноябрь
        months1[11] = 31; // декабрь

        //более короткий вариант
        int[] months2 = new int[] { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };

        //самый короткий вариант
        int[] months3 = { 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31 };

        // работает не только с типом int
        String[] months4 = { "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"};

    }
}
